Revit 2027 API
BuiltInFailures.FamilyFailures.CantMoveFrozenInstance Property
 A family instance placed on a curved surface of a linked file can't be moved while the link is unloaded. To move the instance, reload the link or rehost the instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantMoveFrozenInstance { get; }
Public Shared ReadOnly Property CantMoveFrozenInstance As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantMoveFrozenInstance {
	FailureDefinitionId^ get ();
}
static member CantMoveFrozenInstance : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace